cctv180/STM32H743XI_RTX_Demo/User/bsp/src/bsp_uart_fifo.c
#if UART7_FIFO_EN == 1
    static UART_T g_tUart7;
    static uint8_t g_TxBuf7[UART7_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf7[UART7_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART8_FIFO_EN == 1
    static UART_T g_tUart8;
    static uint8_t g_TxBuf8[UART8_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf8[UART8_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif
        
static void UartVarInit(void);
static void InitHardUart(void);
static void RS485_InitTXE(void);
static void bsp_InitUartParam(COM_PORT_E _ucPort, uint32_t BaudRate, uint32_t Parity, uint32_t Mode);

static UART_T* ComToUart(COM_PORT_E _ucPort);
static uint8_t UartGetChar(UART_T* _pUart, uint8_t* _pByte);
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen);
static void UartIRQ(UART_T *_pUart);

static void RS485_ReciveNew(uint8_t _byte);
static void RS485_SendOver(void);
static void RS485_SendBefor(void);

/*
*********************************************************************************************************
*	函 数 名: bsp_InitUart
*	功能说明: 初始化串口硬件，并对全局变量赋初值.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitUart(void)
{
    UartVarInit();		/* 必须先初始化全局变量,再配置硬件 */

    InitHardUart();		/* 配置串口的硬件参数(波特率等) */

    RS485_InitTXE();	/* 配置RS485芯片的发送使能硬件，配置为推挽输出 */
}

/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为UART指针
*	形    参: _ucPort: 端口号(COM1 - COM8)
*	返 回 值: uart指针
*********************************************************************************************************
*/
static UART_T *ComToUart(COM_PORT_E _ucPort)
{
    if (_ucPort == COM1)
    {
        #if UART1_FIFO_EN == 1
            return &g_tUart1;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM2)
    {
        #if UART2_FIFO_EN == 1
            return &g_tUart2;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM3)
    {
        #if UART3_FIFO_EN == 1
            return &g_tUart3;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM4)
    {
        #if UART4_FIFO_EN == 1
            return &g_tUart4;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM5)
    {
        #if UART5_FIFO_EN == 1
            return &g_tUart5;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM6)
    {
        #if UART6_FIFO_EN == 1
            return &g_tUart6;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM7)
    {
        #if UART7_FIFO_EN == 1
            return &g_tUart7;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM8)
    {
        #if UART8_FIFO_EN == 1
            return &g_tUart8;
        #else
            return 0;
        #endif
    }	
    else
    {
        Error_Handler(__FILE__, __LINE__);
        return 0;
    }
}

/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为 USART_TypeDef* USARTx
*	形    参: _ucPort: 端口号(COM1 - COM8)
*	返 回 值: USART_TypeDef*,  USART1, USART2, USART3, UART4, UART5，USART6，UART7，UART8。
*********************************************************************************************************
*/
#if 0
USART_TypeDef *ComToUSARTx(COM_PORT_E _ucPort)
{
    if (_ucPort == COM1)
    {
        #if UART1_FIFO_EN == 1
            return USART1;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM2)
    {
        #if UART2_FIFO_EN == 1
            return USART2;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM3)
    {
        #if UART3_FIFO_EN == 1
            return USART3;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM4)
    {
        #if UART4_FIFO_EN == 1
            return UART4;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM5)
    {
        #if UART5_FIFO_EN == 1
            return UART5;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM6)
    {
        #if UART6_FIFO_EN == 1
            return USART6;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM7)
    {
        #if UART7_FIFO_EN == 1
            return UART7;
        #else
            return 0;
        #endif
    }
    else if (_ucPort == COM8)
    {
        #if UART8_FIFO_EN == 1
            return UART8;
        #else
            return 0;
        #endif
    }	
    
    else
    {
        /* 不做任何处理 */
        return 0;
    }
}
#endif

/*
*********************************************************************************************************
*	函 数 名: comSendBuf
*	功能说明: 向串口发送一组数据。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _ucaBuf: 待发送的数据缓冲区
*			  _usLen : 数据长度
*	返 回 值: 无
*********************************************************************************************************
*/
void comSendBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }

    if (pUart->SendBefor != 0)
    {
        pUart->SendBefor();		/* 如果是RS485通信，可以在这个函数中将RS485设置为发送模式 */
    }

    UartSend(pUart, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*	函 数 名: comSendChar
*	功能说明: 向串口发送1个字节。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _ucByte: 待发送的数据
*	返 回 值: 无
*********************************************************************************************************
*/
void comSendChar(COM_PORT_E _ucPort, uint8_t _ucByte)
{
    comSendBuf(_ucPort, &_ucByte, 1);
}

/*
*********************************************************************************************************
*    函 数 名: comPutRxFifo
*    功能说明: 软件向接收FIFO填充数据
*    形    参: _ucPort : 串口设备
*    返 回 值: 无
*********************************************************************************************************
*/
void comPutRxFifo(COM_PORT_E _ucPort, uint8_t* _buf, uint16_t _len)
{
    UART_T* pUart;
    uint16_t i;

