cctv180/STM32H743XI_RTX_Demo/User/bsp/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*	函 数 名: RS485_SendStr
*	功能说明: 向485总线发送一个字符串，0结束。
*	形    参: _pBuf 字符串，0结束
*	返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendStr(char *_pBuf)
{
    RS485_SendBuf((uint8_t *)_pBuf, strlen(_pBuf));
}

/*
*********************************************************************************************************
*	函 数 名: RS485_ReciveNew
*	功能说明: 接收到新的数据
*	形    参: _byte 接收到的新数据
*	返 回 值: 无
*********************************************************************************************************
*/
//extern void MODH_ReciveNew(uint8_t _byte);
static void RS485_ReciveNew(uint8_t _byte)
{
//	MODH_ReciveNew(_byte);
}

/*
*********************************************************************************************************
*	函 数 名: UartVarInit
*	功能说明: 初始化串口相关的变量
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartVarInit(void)
{
#if UART1_FIFO_EN == 1
    memset(&g_tUart1, 0, sizeof(UART_T));
    g_tUart1.huart.Instance = USART1;
    g_tUart1.huart.Instance = USART1;                       /* STM32 串口设备 */
    g_tUart1.pTxBuf = g_TxBuf1;                             /* 发送缓冲区指针 */
    g_tUart1.pRxBuf = g_RxBuf1;                             /* 接收缓冲区指针 */
    g_tUart1.usTxBufSize = UART1_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart1.usRxBufSize = UART1_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart1.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart1.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart1.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart1.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart1.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart1.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart1.SendBefor = 0;                                 /* 发送数据前的回调函数 */
    g_tUart1.SendOver = 0;                                  /* 发送完毕后的回调函数 */
    g_tUart1.ReciveNew = 0;                                 /* 接收到新数据后的回调函数 */
    g_tUart1.Sending = 0;                                   /* 正在发送中标志 */
#endif

#if UART2_FIFO_EN == 1
    memset(&g_tUart2, 0, sizeof(UART_T));
    g_tUart2.huart.Instance = USART2;                       /* STM32 串口设备 */
    g_tUart2.pTxBuf = g_TxBuf2;                             /* 发送缓冲区指针 */
    g_tUart2.pRxBuf = g_RxBuf2;                             /* 接收缓冲区指针 */
    g_tUart2.usTxBufSize = UART2_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart2.usRxBufSize = UART2_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart2.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart2.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart2.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart2.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart2.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart2.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart2.SendBefor = 0;                                 /* 发送数据前的回调函数 */
    g_tUart2.SendOver = 0;                                  /* 发送完毕后的回调函数 */
    g_tUart2.ReciveNew = 0;                                 /* 接收到新数据后的回调函数 */
    g_tUart2.Sending = 0;                                   /* 正在发送中标志 */
#endif

#if UART3_FIFO_EN == 1
    memset(&g_tUart3, 0, sizeof(UART_T));
    g_tUart3.huart.Instance = USART3;                       /* STM32 串口设备 */
    g_tUart3.pTxBuf = g_TxBuf3;                             /* 发送缓冲区指针 */
    g_tUart3.pRxBuf = g_RxBuf3;                             /* 接收缓冲区指针 */
    g_tUart3.usTxBufSize = UART3_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart3.usRxBufSize = UART3_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart3.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart3.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart3.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart3.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart3.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart3.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart3.SendBefor = RS485_SendBefor;                   /* 发送数据前的回调函数 */
    g_tUart3.SendOver = RS485_SendOver;                     /* 发送完毕后的回调函数 */
    g_tUart3.ReciveNew = RS485_ReciveNew;                   /* 接收到新数据后的回调函数 */
    g_tUart3.Sending = 0;                                   /* 正在发送中标志 */
#endif

#if UART4_FIFO_EN == 1
    memset(&g_tUart4, 0, sizeof(UART_T));
    g_tUart4.huart.Instance = UART4;                        /* STM32 串口设备 */
    g_tUart4.pTxBuf = g_TxBuf4;                             /* 发送缓冲区指针 */
    g_tUart4.pRxBuf = g_RxBuf4;                             /* 接收缓冲区指针 */
    g_tUart4.usTxBufSize = UART4_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart4.usRxBufSize = UART4_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart4.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart4.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart4.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart4.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart4.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart4.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart4.SendBefor = 0;                                 /* 发送数据前的回调函数 */
    g_tUart4.SendOver = 0;                                  /* 发送完毕后的回调函数 */
    g_tUart4.ReciveNew = 0;                                 /* 接收到新数据后的回调函数 */
    g_tUart4.Sending = 0;                                   /* 正在发送中标志 */
#endif

#if UART5_FIFO_EN == 1
    memset(&g_tUart5, 0, sizeof(UART_T));
    g_tUart5.huart.Instance = UART5;                        /* STM32 串口设备 */
    g_tUart5.pTxBuf = g_TxBuf5;                             /* 发送缓冲区指针 */
    g_tUart5.pRxBuf = g_RxBuf5;                             /* 接收缓冲区指针 */
    g_tUart5.usTxBufSize = UART5_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart5.usRxBufSize = UART5_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart5.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart5.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart5.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart5.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart5.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart5.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart5.SendBefor = 0;                                 /* 发送数据前的回调函数 */
    g_tUart5.SendOver = 0;                                  /* 发送完毕后的回调函数 */
    g_tUart5.ReciveNew = 0;                                 /* 接收到新数据后的回调函数 */
    g_tUart5.Sending = 0;                                   /* 正在发送中标志 */
#endif

#if UART6_FIFO_EN == 1
    memset(&g_tUart6, 0, sizeof(UART_T));
    g_tUart6.huart.Instance = USART6;                       /* STM32 串口设备 */
    g_tUart6.pTxBuf = g_TxBuf6;                             /* 发送缓冲区指针 */
    g_tUart6.pRxBuf = g_RxBuf6;                             /* 接收缓冲区指针 */
    g_tUart6.usTxBufSize = UART6_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart6.usRxBufSize = UART6_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart6.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart6.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart6.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart6.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart6.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart6.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart6.SendBefor = 0;                                 /* 发送数据前的回调函数 */
    g_tUart6.SendOver = 0;                                  /* 发送完毕后的回调函数 */
    g_tUart6.ReciveNew = 0;                                 /* 接收到新数据后的回调函数 */
    g_tUart6.Sending = 0;                                   /* 正在发送中标志 */
#endif

